#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cosmos.module.wallet_cosmosdb_containers["wallet-instances"].azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-d-eudiw-cosno-01"
      + database_name       = "db"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "wallet-instances"
      + partition_key_path  = "/userId"
      + resource_group_name = "io-d-eudiw-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 1000
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
